from pyecharts import options as opts
from pyecharts.charts import Bar

from a_module1 import handle_time_list
import xlrd

"""
 疫情态势
"""

file = r'考研数据.xlsx'
data = xlrd.open_workbook(file)
table = data.sheets()[0]

area = table.col_values(0)
y16= table.col_values(1)
y17= table.col_values(2)
y18 = table.col_values(3)
y19 = table.col_values(4)
y20 = table.col_values(5)

x1 = area[1:]
y1 = y16[1:]
y2 = y17[1:]
y3 = y18[1:]
y4 = y19[1:]
y5 = y20[1:]
#
# print(x1)
# print(y1)
# print(y2)
# print(y3)
# print(y4)
# print(y5)

area = ['北京', '江苏', '湖北', '河北', '辽宁', '四川', '山东', '湖南', '甘肃', '内蒙古', '海南', '云南', '广东', '广西', '陕西', '黑龙江', '河南', '吉林', '重庆', '上海', '浙江', '宁夏', '江西', '安徽', '山西', '天津', '福建', '新疆','贵州', '西藏', '青海']
year16 = [2.4342, 11.6039, 10.2449, 9.0147, 7.026, 6.3523, 16.1517, '——', 3.3044, 3.9091, '——', '——', 6.1588, '——', 6.8565, 5.6645, 13.5916, 4.1639, 3.9601, 4.4, '——', 0.6848, 4.3982, '——', '——', 3.7007, '——', 1.9963, '——', '——', '——']
year17 = [28.9, 14.4839, 10.7136, 10.3055, 8.446, 8.1871, 18.6664, 7.9577, '——', 3.9371, '——', 3.0338, 8.5307, '——', 7.9, 6.7189, 15.66, 5.0755, 5.3489, 5.2, '——', 0.9279, 5.2125, '——', '——', '——', '——', 2.6388, '——', '——', '——']
year18 = [32.3, 17.0873, 12.0774, 12.058, 9.8111, 11.9523, 21.3803, 9.7, 4.4658, 4.7859, 1.4138, 3.9074, 10.8, 3.3, 9.3661, 7.9242, 18.6, 6.0182, 5.0, 6.0, 7.0, 1.1011, 6.291, '——', '——', '——', '——', '——', '——', '——', '——']
year19 = [38.3, 21.2, 14.4086, 14.7188, 10.9567, 14.1786, 25.4486, '——', 5.5345, 5.9569, '——', 4.9496, 14.0, 4.3, '——', 9.0466, 23.36, '——', '——', '——', '——', '——', 7.8531, '——', '——', 5.7956, 5.8, 3.6022, '——', 0.3641, 0.8829]
year20 = [42.5, 24.9, 16.28, '——', 11.9081, 17.4815, 31.319, 12.2847, 6.23, 7.5366, '——', '——', 17.4, 5.38, '——', 9.9126, '——', 8.0852, 7.9248, '——', 11.0, '——', 9.6505, 16.5, '——', 6.8458, '——', 4.2597, 5.8589, '——', '——']

area_y20 = [list(z) for z in zip(area, year20)]
print(area_y20)

area_y20 = [list(z) for z in zip(area, year20)]
print(area_y20)

# area_year = [['北京', 42.5], ['江苏', 24.9], ['湖北', 16.28], ['河北', '——'], ['辽宁', 11.9081], ['四川', 17.4815], ['山东', 31.319], ['湖南', 12.2847], ['甘肃', 6.23], ['内蒙古', 7.5366], ['海南', '——'], ['云南', '——'], ['广东', 17.4], ['广西', 5.38], ['陕西', '——'], ['黑龙江', 9.9126], ['河南', '——'], ['吉林', 8.0852], ['重庆', 7.9248], ['上海', '——'], ['浙江', 11.0], ['宁夏', '——'], ['江西', 9.6505], ['安徽', 16.5], ['山西', '——'], ['天津', 6.8458], ['福建', '——'], ['新疆', 4.2597], ['贵州', 5.8589], ['西藏', '——'], ['青海', '——']]

#
# c = (
#     Bar()
#     .add_xaxis(x1)
#     .add_yaxis('累计确诊', confirm[1:])
#     .add_yaxis('累计死亡', dead[1:])
#     .add_yaxis('累计治愈', cure[1:])
#     .add_yaxis('累计追踪', track[1:])
#     .add_yaxis('境外输入', overseas[1:])
#     .set_global_opts(
#         title_opts=opts.TitleOpts(title="Bar-显示 ToolBox"),
#         toolbox_opts=opts.ToolboxOpts(),
#         legend_opts=opts.LegendOpts(),
#         datazoom_opts=opts.DataZoomOpts(),
#
#     )
#     .render("s1_疫情态势图1.html")
# )
